import os
from dotenv import load_dotenv

# Load variables from the .env file into the environment
load_dotenv()

# --- LINE Bot Credentials ---
# Reads credentials securely from the environment.
LINE_CHANNEL_SECRET = os.environ.get('LINE_CHANNEL_SECRET')
LINE_CHANNEL_ACCESS_TOKEN = os.environ.get('LINE_CHANNEL_ACCESS_TOKEN')
NG_GROK_DOMAIN = os.environ.get('NG_GROK_DOMAIN')

# --- Game Data ---
# SpyFall locations and roles
SPYFALL_LOCATIONS = {
    "เครื่องบิน": [
        "กัปตัน", "นักบินผู้ช่วย", "พนักงานต้อนรับบนเครื่องบิน", "ตำรวจอากาศ",
        "ช่างเครื่อง", "ผู้โดยสารชั้นหนึ่ง", "เจ้าหน้าที่ควบคุมการจราจรทางอากาศ", "เจ้าหน้าที่ภาคพื้น",
        "พนักงานขนกระเป๋า", "แอร์โฮสเตส"
    ],
    "โรงพยาบาล": [
        "หมอ", "พยาบาล", "ศัลยแพทย์", "คนไข้",
        "หน่วยกู้ชีพ", "นักรังสีวิทยา", "เภสัชกร", "พนักงานเข็นเตียง",
        "พนักงานแผนกฉุกเฉิน", "เจ้าหน้าที่ห้องปฏิบัติการ"
    ],
    "วัด": [
        "พระ", "เจ้าอาวาส", "ผู้มาทำบุญ", "มัคนายก",
        "ไกด์นำเที่ยว", "หมอดู", "คนขายเครื่องราง", "แม่ชี",
        "คนขายพระ", "เณร"
    ],
    "โรงเรียน": [
        "ครูใหญ่", "ครูวิทยาศาสตร์", "สารวัตนักเรียน", "ภารโรง",
        "ประธานนักเรียน", "ครูพยาบาล", "พนักงานโรงอาหาร", "ครูพละ",
        "ครูแนะแนว", "ครูเลข"
    ],
    "มหาวิทยาลัย": [
        "ศาสตราจารย์", "นักศึกษา", "คณบดี", "เจ้าหน้าที่ห้องสมุด",
        "ผู้ช่วยในห้องแล็บ", "ยามมหาวิทยาลัย", "เจ้าหน้าที่ฝ่ายรับสมัคร", "นักวิจัย",
        "ผู้ช่วยสอน", "เจ้าหน้าที่ดูแลอาคาร"
    ],
    "ออฟฟิศ": [
        "ซีอีโอ", "ผู้จัดการแผนก", "นักศึกษาฝึกงาน", "ฝ่ายไอที",
        "นักบัญชี", "ฝ่ายบุคคล (HR)", "เลขา", "ฝ่ายการตลาด",
        "หัวหน้าฝ่าย", "ฝ่ายพัฒนานวัตกรรม"
    ],
    "ห้างสรรพสินค้า": [
        "พนักงานแคชเชียร์", "ผู้จัดการห้าง", "หัวขโมย", "ลูกค้า VIP",
        "พนักงานเติมของ", "นักจัดแสดงสินค้า", "ผู้ช่วยส่วนตัวในการช็อปปิ้ง", "พนักงานทำความสะอาด",
        "พนักงานลิฟต์", "พนักงานขาย"
    ],
    "สปอร์ตคลับ": [
        "เทรนเนอร์ส่วนตัว", "สมาชิกคลับ", "ผู้ดูแลคอร์ตเทนนิส", "ครูสอนโยคะ",
        "ผู้ดูแลสระว่ายน้ำ", "พนักงานต้อนรับ", "ไลฟ์การ์ด", "ผู้ดูแลสนามกอล์ฟ",
        "ผู้ดูแลสนามฟุตบอล", "ผู้ดูแลคอร์ตแบดมินตัน"
    ],
    "ร้านอาหาร": [
        "หัวหน้าเชฟ", "บริกร", "นักชิม", "พนักงานเก็บเงิน",
        "คนล้างจาน", "คนปรุงน้ำซุป", "บาร์เทนเดอร์", "เชฟผู้ช่วย",
        "นักวิจารณ์อาหาร", "พนักงานเก็บโต๊ะ"
    ],
    "ชายหาด": [
        "ผู้ดูแลความปลอดภัยทางน้ำ", "นักโต้คลื่น", "นักท่องเที่ยว", "คนขายไอศกรีม",
        "นักวอลเลย์บอลชายหาด", "คนสร้างปราสาททราย", "พ่อค้าแม่ค้า", "นักดำน้ำ",
        "อาสาสมัครชายฝั่ง", "หน่วยยามฝั่ง"
    ]
}


# Insider words for the game
INSIDER_WORDS = ["Apple", "Telescope", "Garden", "Password",
                 "Symphony", "Volcano", "Bicycle", "Sunshine",
                 "Pillow", "Whisper", "Mirage", "Jigsaw"]